#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_function_app.customer_data must be replaced
-/+ resource "azurerm_function_app" "customer_data" {
        app_service_plan_id            = "/subscriptions/959965bb-d9df-4c6f-825e-37e1090d817d/resourceGroups/CustomerData/providers/Microsoft.Web/serverfarms/jwcustomerdataplan"
      ~ app_settings                   = {
            "APPINSIGHTS_INSTRUMENTATIONKEY" = "37f1f62c-effd-4f4a-acdf-89dc2e3645f2"
            "FUNCTIONS_WORKER_RUNTIME"       = "dotnet"
          ~ "TokenCreator__ClientSecret"     = "@Microsoft.KeyVault(SecretUri=https://jwappkeyvault.vault.azure.net/secrets/app-client-secret/latest)" -> "@Microsoft.KeyVault(SecretUri=https://jwappkeyvault.vault.azure.net/secrets/app-client-secret/)"
            "WEBSITE_RUN_FROM_PACKAGE"       = "1"
        }
      ~ client_affinity_enabled        = false -> (known after apply)
      ~ default_hostname               = "jwcustomerdataapi.azurewebsites.net" -> (known after apply)
        enable_builtin_logging         = true
        enabled                        = true
        https_only                     = false
      ~ id                             = "/subscriptions/959965bb-d9df-4c6f-825e-37e1090d817d/resourceGroups/CustomerData/providers/Microsoft.Web/sites/jwcustomerdataapi" -> (known after apply)
      ~ kind                           = "functionapp" -> (known after apply)
        location                       = "westus2"
        name                           = "jwcustomerdataapi"
      ~ outbound_ip_addresses          = "13.66.212.205,13.66.160.18,13.77.175.52,13.66.169.11,13.66.165.244" -> (known after apply)
      ~ possible_outbound_ip_addresses = "13.66.212.205,13.66.160.18,13.77.175.52,13.66.169.11,13.66.165.244,13.77.167.225,13.66.168.182,13.77.167.216" -> (known after apply)
        resource_group_name            = "CustomerData"
      ~ site_credential                = [
          - {
              - password = "TQzcnMMhFG8jMRX4JvvKTvofLlxS09gyNEFydb79PcxhAnQx3bteq0tpYz64"
              - username = "$jwcustomerdataapi"
            },
        ] -> (known after apply)
      ~ storage_connection_string      = (sensitive value)
      - tags                           = {} -> null
        version                        = "~3"

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ site_config {
          ~ always_on                 = false -> (known after apply)
          ~ ftps_state                = "AllAllowed" -> (known after apply)
          ~ http2_enabled             = false -> (known after apply)
          ~ ip_restriction            = [] -> (known after apply)
          + linux_fx_version          = (known after apply)
          ~ min_tls_version           = "1.2" -> (known after apply)
          ~ use_32_bit_worker_process = true -> (known after apply)
          ~ websockets_enabled        = false -> (known after apply)

          ~ cors {
              ~ allowed_origins     = [
                  - "https://functions-next.azure.com",
                  - "https://functions-staging.azure.com",
                  - "https://functions.azure.com",
                ] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }
    }

  # azurerm_function_app.policy_manager must be replaced
-/+ resource "azurerm_function_app" "policy_manager" {
        app_service_plan_id            = "/subscriptions/959965bb-d9df-4c6f-825e-37e1090d817d/resourceGroups/PolicyManager/providers/Microsoft.Web/serverfarms/jwpolicymanagerplan"
      ~ app_settings                   = {
            "APPINSIGHTS_INSTRUMENTATIONKEY" = "95d4db9c-3189-47ac-9c18-f7423e35169a"
            "FUNCTIONS_WORKER_RUNTIME"       = "dotnet"
          ~ "TokenCreator__ClientSecret"     = "@Microsoft.KeyVault(SecretUri=https://jwappkeyvault.vault.azure.net/secrets/app-client-secret/latest)" -> "@Microsoft.KeyVault(SecretUri=https://jwappkeyvault.vault.azure.net/secrets/app-client-secret/)"
            "WEBSITE_RUN_FROM_PACKAGE"       = "1"
        }
      ~ client_affinity_enabled        = false -> (known after apply)
      ~ default_hostname               = "jwpolicymanagerapi.azurewebsites.net" -> (known after apply)
        enable_builtin_logging         = true
        enabled                        = true
        https_only                     = false
      ~ id                             = "/subscriptions/959965bb-d9df-4c6f-825e-37e1090d817d/resourceGroups/PolicyManager/providers/Microsoft.Web/sites/jwpolicymanagerapi" -> (known after apply)
      ~ kind                           = "functionapp" -> (known after apply)
        location                       = "westus2"
        name                           = "jwpolicymanagerapi"
      ~ outbound_ip_addresses          = "13.66.138.97,52.191.189.71,52.191.132.158,52.183.29.21,13.77.150.118" -> (known after apply)
      ~ possible_outbound_ip_addresses = "13.66.138.97,52.191.189.71,52.191.132.158,52.183.29.21,13.77.150.118,52.191.134.181,52.191.135.61,52.229.15.78" -> (known after apply)
        resource_group_name            = "PolicyManager"
      ~ site_credential                = [
          - {
              - password = "DLtfighzgFtARp6k3ij8Wy4LhEWMxubqJdLTbX22DwgZH4y3jxeYZx9Byg0W"
              - username = "$jwpolicymanagerapi"
            },
        ] -> (known after apply)
      ~ storage_connection_string      = (sensitive value)
      - tags                           = {} -> null
        version                        = "~3"

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = (known after apply)
          + type  = (known after apply)
          + value = (sensitive value)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ site_config {
          ~ always_on                 = false -> (known after apply)
          ~ ftps_state                = "AllAllowed" -> (known after apply)
          ~ http2_enabled             = false -> (known after apply)
          ~ ip_restriction            = [] -> (known after apply)
          + linux_fx_version          = (known after apply)
          ~ min_tls_version           = "1.2" -> (known after apply)
          ~ use_32_bit_worker_process = true -> (known after apply)
          ~ websockets_enabled        = false -> (known after apply)

          ~ cors {
              ~ allowed_origins     = [
                  - "https://functions-next.azure.com",
                  - "https://functions-staging.azure.com",
                  - "https://functions.azure.com",
                ] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }
    }

  # azurerm_storage_account.customer_data must be replaced
-/+ resource "azurerm_storage_account" "customer_data" {
      + access_tier                      = (known after apply)
      ~ account_kind                     = "Storage" -> "StorageV2" # forces replacement
        account_replication_type         = "LRS"
        account_tier                     = "Standard"
      ~ enable_https_traffic_only        = false -> true
      ~ id                               = "/subscriptions/959965bb-d9df-4c6f-825e-37e1090d817d/resourceGroups/CustomerData/providers/Microsoft.Storage/storageAccounts/jwcustomerdatastorage" -> (known after apply)
        is_hns_enabled                   = false
        location                         = "westus2"
        name                             = "jwcustomerdatastorage"
      ~ primary_access_key               = (sensitive value)
      ~ primary_blob_connection_string   = (sensitive value)
      ~ primary_blob_endpoint            = "https://jwcustomerdatastorage.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                = "jwcustomerdatastorage.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      ~ primary_file_endpoint            = "https://jwcustomerdatastorage.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                = "jwcustomerdatastorage.file.core.windows.net" -> (known after apply)
      ~ primary_location                 = "westus2" -> (known after apply)
      ~ primary_queue_endpoint           = "https://jwcustomerdatastorage.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host               = "jwcustomerdatastorage.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint           = "https://jwcustomerdatastorage.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host               = "jwcustomerdatastorage.table.core.windows.net" -> (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
        resource_group_name              = "CustomerData"
      ~ secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      ~ secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      ~ tags                             = {} -> (known after apply)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }
    }

  # azurerm_storage_account.policy_manager must be replaced
-/+ resource "azurerm_storage_account" "policy_manager" {
      + access_tier                      = (known after apply)
      ~ account_kind                     = "Storage" -> "StorageV2" # forces replacement
        account_replication_type         = "LRS"
        account_tier                     = "Standard"
      ~ enable_https_traffic_only        = false -> true
      ~ id                               = "/subscriptions/959965bb-d9df-4c6f-825e-37e1090d817d/resourceGroups/PolicyManager/providers/Microsoft.Storage/storageAccounts/jwpolicymanagerstorage" -> (known after apply)
        is_hns_enabled                   = false
        location                         = "westus2"
        name                             = "jwpolicymanagerstorage"
      ~ primary_access_key               = (sensitive value)
      ~ primary_blob_connection_string   = (sensitive value)
      ~ primary_blob_endpoint            = "https://jwpolicymanagerstorage.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                = "jwpolicymanagerstorage.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      ~ primary_file_endpoint            = "https://jwpolicymanagerstorage.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                = "jwpolicymanagerstorage.file.core.windows.net" -> (known after apply)
      ~ primary_location                 = "westus2" -> (known after apply)
      ~ primary_queue_endpoint           = "https://jwpolicymanagerstorage.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host               = "jwpolicymanagerstorage.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint           = "https://jwpolicymanagerstorage.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host               = "jwpolicymanagerstorage.table.core.windows.net" -> (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
        resource_group_name              = "PolicyManager"
      ~ secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      ~ secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      ~ tags                             = {} -> (known after apply)

      + blob_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      ~ network_rules {
          ~ bypass                     = [
              - "AzureServices",
            ] -> (known after apply)
          ~ default_action             = "Allow" -> (known after apply)
          ~ ip_rules                   = [] -> (known after apply)
          ~ virtual_network_subnet_ids = [] -> (known after apply)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 7 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = false -> (known after apply)
              ~ read                  = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = false -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = false -> (known after apply)
              ~ include_apis          = false -> (known after apply)
              ~ retention_policy_days = 0 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>

*Workflow: `Authorization Service PR`, Action: `hashicorpterraform-github-actions4`, Working Directory: `deployment/cloud`*
